---
title: CurtainWallFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CurtainWallFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 38
---

# CurtainWallFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AdjustEndCurtainWallParameterNoCorners { get; }` | `CurtainWallFailures.AdjustEndCurtainWallParameterNoCorners` | FailureDefinitionId |
| `FailureDefinitionId AllGridSegmentsRemoved { get; }` | `CurtainWallFailures.AllGridSegmentsRemoved` | FailureDefinitionId |
| `FailureDefinitionId CannotApplyGridSpecification { get; }` | `CurtainWallFailures.CannotApplyGridSpecification` | FailureDefinitionId |
| `FailureDefinitionId CannotDivideCurtainGrid { get; }` | `CurtainWallFailures.CannotDivideCurtainGrid` | FailureDefinitionId |
| `FailureDefinitionId CannotGroupCurtainGridHost { get; }` | `CurtainWallFailures.CannotGroupCurtainGridHost` | FailureDefinitionId |
| `FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; }` | `CurtainWallFailures.CannotHaveIndependentOverlappingGrids` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceSplitMullions { get; }` | `CurtainWallFailures.CannotPlaceSplitMullions` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitOldMullions { get; }` | `CurtainWallFailures.CannotSplitOldMullions` | FailureDefinitionId |
| `FailureDefinitionId CannotSwitchToCurtainWall { get; }` | `CurtainWallFailures.CannotSwitchToCurtainWall` | FailureDefinitionId |
| `FailureDefinitionId CannotUseCornerMullion { get; }` | `CurtainWallFailures.CannotUseCornerMullion` | FailureDefinitionId |
| `FailureDefinitionId CurtainGridFaceCannotBeReparamForGridRotation { get; }` | `CurtainWallFailures.CurtainGridFaceCannotBeReparamForGridRotation` | FailureDefinitionId |
| `FailureDefinitionId CurtainGridOffHost { get; }` | `CurtainWallFailures.CurtainGridOffHost` | FailureDefinitionId |
| `FailureDefinitionId CurtainSystemHostInvisible { get; }` | `CurtainWallFailures.CurtainSystemHostInvisible` | FailureDefinitionId |
| `FailureDefinitionId DanglingCurtainWallCorner { get; }` | `CurtainWallFailures.DanglingCurtainWallCorner` | FailureDefinitionId |
| `FailureDefinitionId DeletingCurtainSystemFaceGridLines { get; }` | `CurtainWallFailures.DeletingCurtainSystemFaceGridLines` | FailureDefinitionId |
| `FailureDefinitionId DependentGridlineMayBeDeleted { get; }` | `CurtainWallFailures.DependentGridlineMayBeDeleted` | FailureDefinitionId |
| `FailureDefinitionId ExceedMaxDrivenGridlines { get; }` | `CurtainWallFailures.ExceedMaxDrivenGridlines` | FailureDefinitionId |
| `FailureDefinitionId ExessiveBeltDistance { get; }` | `CurtainWallFailures.ExessiveBeltDistance` | FailureDefinitionId |
| `FailureDefinitionId GridlinesOutOfBounds { get; }` | `CurtainWallFailures.GridlinesOutOfBounds` | FailureDefinitionId |
| `FailureDefinitionId GridlinesOutOfBoundsWarn { get; }` | `CurtainWallFailures.GridlinesOutOfBoundsWarn` | FailureDefinitionId |
| `FailureDefinitionId GridlinesOutsideWillBeRedependent { get; }` | `CurtainWallFailures.GridlinesOutsideWillBeRedependent` | FailureDefinitionId |
| `FailureDefinitionId GridlinesOverlap { get; }` | `CurtainWallFailures.GridlinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId GridlinesWerePushed { get; }` | `CurtainWallFailures.GridlinesWerePushed` | FailureDefinitionId |
| `FailureDefinitionId GridOutOfOrder { get; }` | `CurtainWallFailures.GridOutOfOrder` | FailureDefinitionId |
| `FailureDefinitionId GridOutOfOrderError { get; }` | `CurtainWallFailures.GridOutOfOrderError` | FailureDefinitionId |
| `FailureDefinitionId GridOutsideWall { get; }` | `CurtainWallFailures.GridOutsideWall` | FailureDefinitionId |
| `FailureDefinitionId InvalidSkipSegments { get; }` | `CurtainWallFailures.InvalidSkipSegments` | FailureDefinitionId |
| `FailureDefinitionId MullionLostRefReorder { get; }` | `CurtainWallFailures.MullionLostRefReorder` | FailureDefinitionId |
| `FailureDefinitionId MullionsWillBeDeleted { get; }` | `CurtainWallFailures.MullionsWillBeDeleted` | FailureDefinitionId |
| `FailureDefinitionId MultipleDominatingMullions { get; }` | `CurtainWallFailures.MultipleDominatingMullions` | FailureDefinitionId |
| `FailureDefinitionId MultipleIdsInCurtainSystem { get; }` | `CurtainWallFailures.MultipleIdsInCurtainSystem` | FailureDefinitionId |
| `FailureDefinitionId MustReplacePanels { get; }` | `CurtainWallFailures.MustReplacePanels` | FailureDefinitionId |
| `FailureDefinitionId NegativeBeltDistance { get; }` | `CurtainWallFailures.NegativeBeltDistance` | FailureDefinitionId |
| `FailureDefinitionId NonSupportedCurtainWall { get; }` | `CurtainWallFailures.NonSupportedCurtainWall` | FailureDefinitionId |
| `FailureDefinitionId NoPanelsLoaded { get; }` | `CurtainWallFailures.NoPanelsLoaded` | FailureDefinitionId |
| `FailureDefinitionId RequestOrphanMullionDeletion { get; }` | `CurtainWallFailures.RequestOrphanMullionDeletion` | FailureDefinitionId |
| `FailureDefinitionId RuledCurtainElementLostCurves { get; }` | `CurtainWallFailures.RuledCurtainElementLostCurves` | FailureDefinitionId |
| `FailureDefinitionId TypePanelsFronNonRectCellsUnlocked { get; }` | `CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```